# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTableIterator..::..Reset Method
ExportLineweightTableIterator Class See Also
---
Resets the iterator to the initial state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
ExportLineweightTableIterator Class
Autodesk.Revit.DB Namespace